tap "homebrew/services"

# Dev related.
################################################################################
cask "android-studio"    # RE stuff
cask "mitmproxy"
brew "apktool"
brew "protobuf"
brew "xz"
brew "jadx"

cask "zed"               # I am old now
cask "jetbrains-toolbox"
cask "font-fira-code"

cask "iterm2"            # Low latency terminal
brew "starship"

cask "openvpn-connect"   # I'll delete this once im rich
cask "postman"
cask "bruno"
cask "telegram"

brew "go"                # I wish one day for all of these to
brew "node"              # just cease to exist and I can finally
brew "rustup"            # write undocumented and unusable C code.

cask "mongodb-compass"   # DB clients
cask "tableplus"

brew "fd"                # CLI tools
brew "entr"

brew "redis"             # Services

# Everyday
################################################################################
cask "chatgpt"  # Thank God for OpenAI, now I don't have to write my
                # shitty code myself.

cask "spotify"  # Life without this is unbearable..

brew "d2"       # I need diagrams sometimes.

cask "obsidian" # I need to somehow organize my life, so here it goes.

cask "discord"  # Socialising is important, I guess.
