tap "homebrew/bundle"

# code
brew "neovim"
cask "font-jetbrains-mono-nerd-font"
cask "iterm2"
cask "visual-studio-code"

# lang
brew "go"
brew "node"

# cli
brew "clang-format"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "pkg-config"
brew "ripgrep"
brew "wget"

# libs
brew "raylib"

# apps
cask "ableton-live-suite"
cask "arc"
cask "bruno"
cask "chatgpt"
cask "docker"
cask "mongodb-compass"
cask "openvpn-connect"
cask "spotify"
cask "telegram"
